name: "Deeper_CNN_Asym_BN"
layer {
  name: "data"
  type: "PatchBasedSegmentationData"
  top: "data"
  top: "label"
  patch_based_segmentation_data_param {
    source: "../../data/mass_merged/lmdb/train.lmdb"
    batch_size: 128
    rand_skip: 128

    # data patch detail
    data_channels: 3
    data_height: 64
    data_width: 64

    # label patch detail
    label_channels: 3
    label_height: 16
    label_width: 16

    # augmentation
    rotation: true
    flip: true
    has_value: true
    skip_blank: true
  }
  include: { phase: TRAIN }
}
layer {
  name: "data"
  type: "PatchBasedSegmentationData"
  top: "data"
  top: "label"
  patch_based_segmentation_data_param {
    source: "../../data/mass_merged/lmdb/test.lmdb"
    batch_size: 128
    rand_skip: 128

    # data patch detail
    data_channels: 3
    data_height: 64
    data_width: 64

    # label patch detail
    label_channels: 3
    label_height: 16
    label_width: 16

    # augmentation
    rotation: true
    flip: true
    has_value: true
    skip_blank: true
  }
  include: { phase: TEST }
}
layer {
  name: "mvn1"
  type: "MVN"
  bottom: "data"
  top: "mvn1"
  mvn_param {
    normalize_variance: true
    across_channels: false
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "mvn1"
  top: "conv2"
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "bn3"
  type: "BN"
  bottom: "conv2"
  top: "bn3"
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0.001
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "bn3"
  top: "relu4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "relu4"
  top: "conv5"
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "bn6"
  type: "BN"
  bottom: "conv5"
  top: "bn6"
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0.001
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "bn6"
  top: "relu7"
}
layer {
  name: "conv8"
  type: "Convolution"
  bottom: "relu7"
  top: "conv8"
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "bn9"
  type: "BN"
  bottom: "conv8"
  top: "bn9"
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0.001
    }
  }
}
layer {
  name: "relu10"
  type: "ReLU"
  bottom: "bn9"
  top: "relu10"
}
layer {
  name: "conv11"
  type: "Convolution"
  bottom: "relu10"
  top: "conv11"
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "bn12"
  type: "BN"
  bottom: "conv11"
  top: "bn12"
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0.001
    }
  }
}
layer {
  name: "relu13"
  type: "ReLU"
  bottom: "bn12"
  top: "relu13"
}
layer {
  name: "conv14"
  type: "Convolution"
  bottom: "relu13"
  top: "conv14"
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "bn15"
  type: "BN"
  bottom: "conv14"
  top: "bn15"
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0.001
    }
  }
}
layer {
  name: "relu16"
  type: "ReLU"
  bottom: "bn15"
  top: "relu16"
}
layer {
  name: "conv17"
  type: "Convolution"
  bottom: "relu16"
  top: "conv17"
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "bn18"
  type: "BN"
  bottom: "conv17"
  top: "bn18"
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0.001
    }
  }
}
layer {
  name: "relu19"
  type: "ReLU"
  bottom: "bn18"
  top: "relu19"
}
layer {
  name: "fc20"
  type: "InnerProduct"
  bottom: "relu19"
  top: "fc20"
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu21"
  type: "ReLU"
  bottom: "fc20"
  top: "relu21"
}
layer {
  name: "fc22"
  type: "InnerProduct"
  bottom: "relu21"
  top: "fc22"
  inner_product_param {
    num_output: 768
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "reshape23"
  type: "Reshape"
  bottom: "fc22"
  top: "reshape23"
  reshape_param {
    channels: 3
    height: 16
    width: 16
  }
}
layer {
  name: "predict_loss"
  type: "SoftmaxCrossEntropyLoss"
  bottom: "reshape23"
  bottom: "label"
  top: "predict_loss"
  loss_weight: 1
  softmax_cross_entropy_loss_param {
    weights: 0
    weights: 1.5
    weights: 1.5
  }
}
layer {
  name: "precision_recall_loss"
  type: "PrecisionRecallLoss"
  bottom: "reshape23"
  bottom: "label"
  top: "error_rate"
  include: { phase: TEST }
}
