name: "Mnih_CNN_Asym_MVN"
layer {
  name: "input_data"
  type: "Data"
  top: "input_data"
  data_param {
    backend: LMDB
    source: "../../data/mass_merged/lmdb/train_sat"
    batch_size: 128
  }
  include: { phase: TRAIN }
}
layer {
  name: "input_label"
  type: "Data"
  top: "input_label"
  data_param {
    backend: LMDB
    source: "../../data/mass_merged/lmdb/train_map"
    batch_size: 128
  }
  include: { phase: TRAIN }
}
layer {
  name: "input_data"
  type: "Data"
  top: "input_data"
  data_param {
    backend: LMDB
    source: "../../data/mass_merged/lmdb/test_sat"
    batch_size: 128
  }
  include: { phase: TEST }
}
layer {
  name: "input_label"
  type: "Data"
  top: "input_label"
  data_param {
    backend: LMDB
    source: "../../data/mass_merged/lmdb/test_map"
    batch_size: 128
  }
  include: { phase: TEST }
}
layer {
  name: "augment1"
  type: "Augment"
  bottom: "input_data"
  bottom: "input_label"
  top: "augment1"
  top: "label"
  augment_param {
    # common
    rotate: true
    flip: true
    # data
    crop_size: 64
    binarize: false
    mean_normalize: true
    divide: 48.519772
    divide: 46.991936
    divide: 49.015851
    # label
    crop_size: 16
    binarize: true
  }
  include: { phase: TRAIN }
}
layer {
  name: "augment1"
  type: "Augment"
  bottom: "input_data"
  bottom: "input_label"
  top: "augment1"
  top: "label"
  augment_param {
    # data
    crop_size: 64
    binarize: false
    mean_normalize: true
    divide: 48.519772
    divide: 46.991936
    divide: 49.015851
    # label
    crop_size: 16
    binarize: true
  }
  include: { phase: TEST }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "augment1"
  top: "conv2"
  convolution_param {
    num_output: 64
    kernel_size: 16
    stride: 4
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv2"
  top: "relu3"
}
layer {
  name: "mvn4"
  type: "MVN"
  bottom: "relu3"
  top: "mvn4"
  mvn_param {
    normalize_variance: true
    across_channels: false
  }
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "mvn4"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 1
  }
}
layer {
  name: "conv6"
  type: "Convolution"
  bottom: "pool5"
  top: "conv6"
  convolution_param {
    num_output: 112
    kernel_size: 4
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "conv6"
  top: "relu7"
}
layer {
  name: "mvn8"
  type: "MVN"
  bottom: "relu7"
  top: "mvn8"
  mvn_param {
    normalize_variance: true
    across_channels: false
  }
}
layer {
  name: "conv9"
  type: "Convolution"
  bottom: "mvn8"
  top: "conv9"
  convolution_param {
    num_output: 80
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu10"
  type: "ReLU"
  bottom: "conv9"
  top: "relu10"
}
layer {
  name: "mvn11"
  type: "MVN"
  bottom: "relu10"
  top: "mvn11"
  mvn_param {
    normalize_variance: true
    across_channels: false
  }
}
layer {
  name: "fc12"
  type: "InnerProduct"
  bottom: "mvn11"
  top: "fc12"
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu13"
  type: "ReLU"
  bottom: "fc12"
  top: "relu13"
}
layer {
  name: "mvn14"
  type: "MVN"
  bottom: "relu13"
  top: "mvn14"
  mvn_param {
    normalize_variance: true
    across_channels: true
  }
}
layer {
  name: "fc15"
  type: "InnerProduct"
  bottom: "mvn14"
  top: "fc15"
  inner_product_param {
    num_output: 768
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "reshape16"
  type: "Reshape"
  bottom: "fc15"
  top: "reshape16"
  reshape_param {
    channels: 3
    height: 16
    width: 16
  }
}
layer {
  name: "predict_loss"
  type: "SoftmaxCrossEntropyLoss"
  bottom: "reshape16"
  bottom: "label"
  top: "predict_loss"
  loss_weight: 1
  softmax_cross_entropy_loss_param {
    weights: 0
    weights: 1.5
    weights: 1.5
  }
}
layer {
  name: "precision_recall_loss"
  type: "PrecisionRecallLoss"
  bottom: "reshape16"
  bottom: "label"
  top: "error_rate"
  include: { phase: TEST }
}
