name: "Mnih_CNN_BN"
layer {
  name: "input_data"
  type: "Data"
  top: "input_data"
  data_param {
    backend: LMDB
    source: "../../data/mass_merged/lmdb/train_sat"
    batch_size: 128
  }
  include: { phase: TRAIN }
}
layer {
  name: "input_label"
  type: "Data"
  top: "input_label"
  data_param {
    backend: LMDB
    source: "../../data/mass_merged/lmdb/train_map"
    batch_size: 128
  }
  include: { phase: TRAIN }
}
layer {
  name: "input_data"
  type: "Data"
  top: "input_data"
  data_param {
    backend: LMDB
    source: "../../data/mass_merged/lmdb/test_sat"
    batch_size: 128
  }
  include: { phase: TEST }
}
layer {
  name: "input_label"
  type: "Data"
  top: "input_label"
  data_param {
    backend: LMDB
    source: "../../data/mass_merged/lmdb/test_map"
    batch_size: 128
  }
  include: { phase: TEST }
}
layer {
  name: "augment1"
  type: "Augment"
  bottom: "input_data"
  bottom: "input_label"
  top: "augment1"
  top: "label"
  augment_param {
    # common
    rotate: true
    flip: true
    # data
    crop_size: 64
    binarize: false
    mean_normalize: true
    stddev_normalize: true
    # label
    crop_size: 16
    binarize: true
  }
  include: { phase: TRAIN }
}
layer {
  name: "augment1"
  type: "Augment"
  bottom: "input_data"
  bottom: "input_label"
  top: "augment1"
  top: "label"
  augment_param {
    # data
    crop_size: 64
    binarize: false
    mean_normalize: true
    stddev_normalize: true
    # label
    crop_size: 16
    binarize: true
  }
  include: { phase: TEST }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "augment1"
  top: "conv2"
  convolution_param {
    num_output: 64
    kernel_size: 16
    stride: 4
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "bn3"
  type: "BN"
  bottom: "conv2"
  top: "bn3"
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0.001
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "bn3"
  top: "relu4"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "relu4"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 1
  }
}
layer {
  name: "conv6"
  type: "Convolution"
  bottom: "pool5"
  top: "conv6"
  convolution_param {
    num_output: 112
    kernel_size: 4
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "bn7"
  type: "BN"
  bottom: "conv6"
  top: "bn7"
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0.001
    }
  }
}
layer {
  name: "relu8"
  type: "ReLU"
  bottom: "bn7"
  top: "relu8"
}
layer {
  name: "conv9"
  type: "Convolution"
  bottom: "relu8"
  top: "conv9"
  convolution_param {
    num_output: 80
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "bn10"
  type: "BN"
  bottom: "conv9"
  top: "bn10"
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  param {
    lr_mult: 1.00001
    decay_mult: 0
  }
  bn_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    shift_filler {
      type: "constant"
      value: 0.001
    }
  }
}
layer {
  name: "relu11"
  type: "ReLU"
  bottom: "bn10"
  top: "relu11"
}
layer {
  name: "fc12"
  type: "InnerProduct"
  bottom: "relu11"
  top: "fc12"
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu13"
  type: "ReLU"
  bottom: "fc12"
  top: "relu13"
}
layer {
  name: "fc14"
  type: "InnerProduct"
  bottom: "relu13"
  top: "fc14"
  inner_product_param {
    num_output: 768
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "reshape15"
  type: "Reshape"
  bottom: "fc14"
  top: "reshape15"
  reshape_param {
    channels: 3
    height: 16
    width: 16
  }
}
layer {
  name: "predict_loss"
  type: "SoftmaxCrossEntropyLoss"
  bottom: "reshape15"
  bottom: "label"
  top: "predict_loss"
  loss_weight: 1
  softmax_cross_entropy_loss_param {
    weights: 1
    weights: 1
    weights: 1
  }
}
layer {
  name: "precision_recall_loss"
  type: "PrecisionRecallLoss"
  bottom: "reshape15"
  bottom: "label"
  top: "error_rate"
  include: { phase: TEST }
}
