name: "Deeper_CNN_MVN"
layer {
  name: "input_data"
  type: "Data"
  top: "input_data"
  data_param {
    backend: LMDB
    source: "../../data/mass_merged/lmdb/train_sat"
    batch_size: 128
  }
  include: { phase: TRAIN }
}
layer {
  name: "input_label"
  type: "Data"
  top: "input_label"
  data_param {
    backend: LMDB
    source: "../../data/mass_merged/lmdb/train_map"
    batch_size: 128
  }
  include: { phase: TRAIN }
}
layer {
  name: "input_data"
  type: "Data"
  top: "input_data"
  data_param {
    backend: LMDB
    source: "../../data/mass_merged/lmdb/test_sat"
    batch_size: 128
  }
  include: { phase: TEST }
}
layer {
  name: "input_label"
  type: "Data"
  top: "input_label"
  data_param {
    backend: LMDB
    source: "../../data/mass_merged/lmdb/test_map"
    batch_size: 128
  }
  include: { phase: TEST }
}
layer {
  name: "augment1"
  type: "Augment"
  bottom: "input_data"
  bottom: "input_label"
  top: "augment1"
  top: "label"
  augment_param {
    # common
    rotate: true
    flip: true
    # data
    crop_size: 64
    binarize: false
    mean_normalize: true
    divide: 48.524406
    divide: 46.994726
    divide: 49.018684
    # label
    crop_size: 16
    binarize: true
  }
  include: { phase: TRAIN }
}
layer {
  name: "augment1"
  type: "Augment"
  bottom: "input_data"
  bottom: "input_label"
  top: "augment1"
  top: "label"
  augment_param {
    # data
    crop_size: 64
    binarize: false
    mean_normalize: true
    divide: 48.524406
    divide: 46.994726
    divide: 49.018684
    # label
    crop_size: 16
    binarize: true
  }
  include: { phase: TEST }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "augment1"
  top: "conv2"
  convolution_param {
    num_output: 64
    kernel_size: 16
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv2"
  top: "relu3"
}
layer {
  name: "mvn4"
  type: "MVN"
  bottom: "relu3"
  top: "mvn4"
  mvn_param {
    normalize_variance: true
    across_channels: false
  }
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "mvn4"
  top: "conv5"
  convolution_param {
    num_output: 128
    kernel_size: 14
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "conv5"
  top: "relu6"
}
layer {
  name: "mvn7"
  type: "MVN"
  bottom: "relu6"
  top: "mvn7"
  mvn_param {
    normalize_variance: true
    across_channels: false
  }
}
layer {
  name: "conv8"
  type: "Convolution"
  bottom: "mvn7"
  top: "conv8"
  convolution_param {
    num_output: 128
    kernel_size: 12
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu9"
  type: "ReLU"
  bottom: "conv8"
  top: "relu9"
}
layer {
  name: "mvn10"
  type: "MVN"
  bottom: "relu9"
  top: "mvn10"
  mvn_param {
    normalize_variance: true
    across_channels: false
  }
}
layer {
  name: "conv11"
  type: "Convolution"
  bottom: "mvn10"
  top: "conv11"
  convolution_param {
    num_output: 128
    kernel_size: 10
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu12"
  type: "ReLU"
  bottom: "conv11"
  top: "relu12"
}
layer {
  name: "mvn13"
  type: "MVN"
  bottom: "relu12"
  top: "mvn13"
  mvn_param {
    normalize_variance: true
    across_channels: false
  }
}
layer {
  name: "fc14"
  type: "InnerProduct"
  bottom: "mvn13"
  top: "fc14"
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu15"
  type: "ReLU"
  bottom: "fc14"
  top: "relu15"
}
layer {
  name: "mvn16"
  type: "MVN"
  bottom: "relu15"
  top: "mvn16"
  mvn_param {
    normalize_variance: true
    across_channels: true
  }
}
layer {
  name: "fc17"
  type: "InnerProduct"
  bottom: "mvn16"
  top: "fc17"
  inner_product_param {
    num_output: 768
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "reshape18"
  type: "Reshape"
  bottom: "fc17"
  top: "reshape18"
  reshape_param {
    channels: 3
    height: 16
    width: 16
  }
}
layer {
  name: "predict_loss"
  type: "SoftmaxCrossEntropyLoss"
  bottom: "reshape18"
  bottom: "label"
  top: "predict_loss"
  loss_weight: 1
  softmax_cross_entropy_loss_param {
    weights: 1
    weights: 1
    weights: 1
  }
}
layer {
  name: "precision_recall_loss"
  type: "PrecisionRecallLoss"
  bottom: "reshape18"
  bottom: "label"
  top: "error_rate"
  include: { phase: TEST }
}
